Repository: giochagelishvili/SuperRate
Catalog: SuperRate/SuperRate.API/Localizations/ErrorMessages.*.resx
Languages: ka_ge

# UsernameInvalidFormat
source: Username must be at least 4, maximum 20 characters long and should only contain letters.
ka_ge: მომხმარებლის სახელი უნდა შედგებოდეს მინიმუმ 4, მაქსიმუმ 20 სიმბოლოსგან და უნდა შეიცავდეს მხოლოდ ასოებს.

# PasswordInvalidFormat
source: Password must be at least 12, maximum 20 characters long and should contain at least one symbol.
ka_ge: პაროლის სიგრძე უნდა იყოს მინიმუმ 12, მაქსიმუმ 20 და უნდა შეიცავდეს მინიმუმ 1 სიმბოლოს.

# UsernameRequired
source: Username is a required field.
ka_ge: მომხმარებლის სახელი აუცილებელი ველია.

# PasswordRequired
source: Password is a required field.
ka_ge: პაროლი აუცილებელი ველია.

# IdentificationNumberRequired
source: Identification number is a required field.
ka_ge: საიდენტიფიკაციო ნომერი აუცილებელი ველია.

# IdentificationNumberInvalidFormat
source: Identification number must contain digits only (minimum 6).
ka_ge: საიდენტიფიკაციო კოდი უნდა შეიცავდეს მხოლოდ ციფრებს (მინიმუმ 6).

# EmailRequired
source: Email is a required field.
ka_ge: ელ-ფოსტა აუცილებელი ველია.

# EmailInvalidFormat
source: Email invalid, please try again.
ka_ge: ელ-ფოსტა არასწორია, გთხოვთ სცადეთ ხელახლა.

# PhoneNumberRequired
source: Phone number is a required field.
ka_ge: ტელეფონის ნომერი აუცილებელი ველია.

# PhoneNumberInvalidFormat
source: Phone number must start with 5 and contain 9 digits in total.
ka_ge: ტელეფონის ნომერი უნდა იწყებოდეს 5-ით და შედგებოდეს 9 ციფრისგან.

# ConfirmPasswordRequired
source: Confirm password is a required field.
ka_ge: პაროლის დადასტურება აუცილებელი ველია.

# PasswordDoesNotMatch
source: Passwords do not match, please try again.
ka_ge: პაროლები არ ემთხვევა, გთხოვთ სცადეთ ხელახლა.
